export default function Section({ title, children, ...props }) {
  //...props взима всички останали пропертита, които са прикачени към компонента, там където той се ползва
  // и ги подава тук, на този компонент. Forwarding Props се нарича това.
  return (
    <section {...props}>
      {/* като ги прикачим по този начин на секцията, можем да вземем id пропертито или className примерно, ако има такова */}
      {/* Много е полезно за обграждащи компоненти */}
      <h2>{title}</h2>
      {children}
      {/* children - запазено име на проперти, което подава на компонента, това което е между отварящия и затварящия таг. */}
    </section>
  );
}
